pas218/ECE1188_Loki/CC3100BOOST_MQTT-TwitterLED_MSP432P401R/main.c
    /*
     * Following function configures the device to default state by cleaning
     * the persistent settings stored in NVMEM (viz. connection profiles &
     * policies, power policy etc)
     *
     * Applications may choose to skip this step if the developer is sure
     * that the device is in its default state at start of application
     *
     * Note that all profiles and persistent settings that were done on the
     * device will be lost
     */
    retVal = configureSimpleLinkToDefaultState();
    if(retVal < 0)
    {
        if (DEVICE_NOT_IN_STATION_MODE == retVal)
            CLI_Write(" Failed to configure the device in its default state \n\r");

        LOOP_FOREVER();
    }

    CLI_Write(" Device is configured in default state \n\r");

    /*
     * Assumption is that the device is configured in station mode already
     * and it is in its default state
     */
    retVal = sl_Start(0, 0, 0);
    if ((retVal < 0) ||
        (ROLE_STA != retVal) )
    {
        CLI_Write(" Failed to start the device \n\r");
        LOOP_FOREVER();
    }

    CLI_Write(" Device started as STATION \n\r");

    /* Connecting to WLAN AP */
    retVal = establishConnectionWithAP();
    if(retVal < 0)
    {
        CLI_Write(" Failed to establish connection w/ an AP \n\r");
        LOOP_FOREVER();
    }

    CLI_Write(" Connection established w/ AP and IP is acquired \n\r");

    // Obtain MAC Address
    sl_NetCfgGet(SL_MAC_ADDRESS_GET,NULL,&macAddressLen,(unsigned char *)macAddressVal);

    // Print MAC Addres to be formatted string
    snprintf(macStr, sizeof(macStr), "%02x:%02x:%02x:%02x:%02x:%02x",
            macAddressVal[0], macAddressVal[1], macAddressVal[2], macAddressVal[3], macAddressVal[4], macAddressVal[5]);

    // Generate 32bit unique ID from TLV Random Number and MAC Address
    generateUniqueID();

    int rc = 0;
    unsigned char buf[100];
    unsigned char readbuf[100];

    NewNetwork(&n);
    rc = ConnectNetwork(&n, MQTT_BROKER_SERVER, 1883);

    if (rc != 0) {
        CLI_Write(" Failed to connect to MQTT broker \n\r");
        LOOP_FOREVER();
    }
    CLI_Write(" Connected to MQTT broker \n\r");

    MQTTClient(&hMQTTClient, &n, 1000, buf, 100, readbuf, 100);
    MQTTPacket_connectData cdata = MQTTPacket_connectData_initializer;
    cdata.MQTTVersion = 3;
    cdata.clientID.cstring = uniqueID;
    rc = MQTTConnect(&hMQTTClient, &cdata);

    if (rc != 0) {
        CLI_Write(" Failed to start MQTT client \n\r");
        LOOP_FOREVER();
    }
    CLI_Write(" Started MQTT client successfully \n\r");

    rc = MQTTSubscribe(&hMQTTClient, SUBSCRIBE_TOPIC, QOS0, messageArrived);

    if (rc != 0) {
        CLI_Write(" Failed to subscribe to /msp/cc3100/demo topic \n\r");
        LOOP_FOREVER();
    }
    CLI_Write(" Subscribed to /msp/cc3100/demo topic \n\r");

    rc = MQTTSubscribe(&hMQTTClient, uniqueID, QOS0, messageArrived);

    if (rc != 0) {
        CLI_Write(" Failed to subscribe to uniqueID topic \n\r");
        LOOP_FOREVER();
    }
    CLI_Write(" Subscribed to uniqueID topic \n\r");

    while(1){
        rc = MQTTYield(&hMQTTClient, 10);
       // if (rc != 0) {
         //   CLI_Write(" MQTT failed to yield \n\r");
           // LOOP_FOREVER();
        //}



        int rc = 0;

        //print max speed
        utoa(maxSpeed, stringHelper);
        rc = 0;
        MQTTMessage msgMaxSpeed;
        msgMaxSpeed.dup = 0;
        msgMaxSpeed.id = 0;
        msgMaxSpeed.payload = stringHelper;
        msgMaxSpeed.payloadlen = 3;
        msgMaxSpeed.qos = QOS0;
        msgMaxSpeed.retained = 0;
        rc = MQTTPublish(&hMQTTClient, MAX_SPEED, &msgMaxSpeed);

        //print numCrashes
        utoa(numCrashed, stringHelper);
        rc = 0;
        MQTTMessage msgNumCrashes;
        msgNumCrashes.dup = 0;
        msgNumCrashes.id = 0;
        msgNumCrashes.payload = stringHelper;
        msgNumCrashes.payloadlen = 3;
        msgNumCrashes.qos = QOS0;
        msgNumCrashes.retained = 0;
        rc = MQTTPublish(&hMQTTClient, NUM_CRASHES, &msgNumCrashes);

        //print trackTime
        utoa(trackTime, stringHelper);
        rc = 0;
        MQTTMessage msgTrackTime;
        msgTrackTime.dup = 0;
        msgTrackTime.id = 0;
        msgTrackTime.payload = stringHelper;
        msgTrackTime.payloadlen = 3;
        msgTrackTime.qos = QOS0;
        msgTrackTime.retained = 0;
        rc = MQTTPublish(&hMQTTClient, TRACK_TIME, &msgTrackTime);

        //print all distances
        int i;
        for(i = 0; i < numMeasurements; i++){

            //int rc = 0;
            //print left distance
            utoa(leftDistanceMeasurements[i], stringHelper);
            rc = 0;
            MQTTMessage msgLeftDistance;
            msgLeftDistance.dup = 0;
            msgLeftDistance.id = 0;
            msgLeftDistance.payload = stringHelper;
            msgLeftDistance.payloadlen = 3;
            msgLeftDistance.qos = QOS0;
            msgLeftDistance.retained = 0;
            rc = MQTTPublish(&hMQTTClient, LEFT_DISTANCE, &msgLeftDistance);

            //print center distance
            utoa(centerDistanceMeasurements[i], stringHelper);
            rc = 0;
            MQTTMessage msgCenterDistance;
            msgCenterDistance.dup = 0;
            msgCenterDistance.id = 0;
            msgCenterDistance.payload = stringHelper;
            msgCenterDistance.payloadlen = 3;
            msgCenterDistance.qos = QOS0;
            msgCenterDistance.retained = 0;
            rc = MQTTPublish(&hMQTTClient, CENTER_DISTANCE, &msgCenterDistance);


            //print right distance
            utoa(rightDistanceMeasurements[i], stringHelper);
            rc = 0;
            MQTTMessage msgRightDistance;
            msgRightDistance.dup = 0;
            msgRightDistance.id = 0;
            msgRightDistance.payload = stringHelper;
            msgRightDistance.payloadlen = 3;
            msgRightDistance.qos = QOS0;
            msgRightDistance.retained = 0;
            rc = MQTTPublish(&hMQTTClient, RIGHT_DISTANCE, &msgRightDistance);

            Delay(50);

